docs/phil.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-16 Fri 18:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Calculator Programs For Stamp Collectors</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Description of some free42/hp-42s/DM42 programs for stamp collectors"
 />













</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://richmit.github.io/hp42/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content">
<h1 class="title">Calculator Programs For Stamp Collectors</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2021-04-16 18:17:15</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright 2021 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1b0aafe">1. Metadata</a></li>
<li><a href="#org648793e">2. Introduction</a></li>
<li><a href="#menu">3. The Main Menu</a></li>
<li><a href="#org226ce8d">4. <code>[CAL]</code>: Image Calibration</a>
<ul>
<li><a href="#orgb718c87">4.1. Known DPI</a>
<ul>
<li><a href="#orgb831e2e">4.1.1. Examples</a></li>
</ul>
</li>
<li><a href="#org0fb0a77">4.2. Using a target</a>
<ul>
<li><a href="#orgc07cb52">4.2.1. Example</a></li>
</ul>
</li>
<li><a href="#orgf54c510">4.3. Using a Stamp!</a></li>
<li><a href="#orge714d10">4.4. Calibration factor</a>
<ul>
<li><a href="#org502112e">4.4.1. Examples</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org684694c">5. <code>[LENG]</code>: Measuring lengths</a>
<ul>
<li><a href="#orgc00aaab">5.1. Horizontal or Vertical Lengths</a>
<ul>
<li><a href="#org103acd6">5.1.1. Examples</a></li>
</ul>
</li>
<li><a href="#orgb996af6">5.2. Generic distances</a>
<ul>
<li><a href="#org02f111a">5.2.1. Examples</a></li>
</ul>
</li>
<li><a href="#org6b47821">5.3. Philatelic Application: Rotary Press vs. Flat Plate (Take 1)</a>
<ul>
<li><a href="#org86a709b">5.3.1. Example 1</a>
<ul>
<li><a href="#orge468106">5.3.1.1. Method 1 (Stamp design not aligned)</a></li>
<li><a href="#orge515d5d">5.3.1.2. Method 2 (Stamp design aligned)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#org149b52e">6. <code>[PERF]</code>: Measuring &amp; Converting Perforations</a>
<ul>
<li>
<ul>
<li><a href="#org4538b3f">6.0.1. Example: Measuring Standard &amp; Kiusalas Perforations</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org10bb178">7. <code>[ANGL]</code>: Measuring Angles</a>
<ul>
<li><a href="#org3a73c28">7.1. Examples</a></li>
<li><a href="#orgde00f9b">7.2. Philatelic Application: Parallel Lines (Take 1)</a>
<ul>
<li><a href="#org1d0731a">7.2.1. Example</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf71931e">8. <code>[DCRD]</code>: Design Coordinates</a>
<ul>
<li><a href="#org188f4ea">8.1. Example</a></li>
</ul>
</li>
<li><a href="#orge67e1fa">9. <code>[QUAD]</code>: A Philatelic Power Tool</a>
<ul>
<li><a href="#org5ee5397">9.1. Philatelic Application: Parallel Lines (Take 2)</a></li>
<li><a href="#orgf3246a3">9.2. Philatelic Application: Rotary Press vs. Flat Plate (Take 2)</a></li>
</ul>
</li>
<li><a href="#orgcd6f64e">10. Code</a>
<ul>
<li><a href="#orgb514f43">10.1. Menu Code</a></li>
<li><a href="#org9c440b9">10.2. Local Functions</a></li>
</ul>
</li>
<li><a href="#orgde0564d">11. EOF</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1b0aafe" class="outline-2">
<h2 id="org1b0aafe"><span class="section-number-2">1</span> Metadata</h2>
<div class="outline-text-2" id="text-1">
<p>
The home for this HTML file is: <a href="https://richmit.github.io/hp42/phil.html">https://richmit.github.io/hp42/phil.html</a>
</p>

<p>
Files related to this document may be found on github: <a href="https://github.com/richmit/hp42">https://github.com/richmit/hp42</a>
</p>

<p>
Directory contents:
</p>
<table border="0" cellspacing="0" cellpadding="6" rules="none" frame="none" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>src</code></td>
<td class="org-left">-</td>
<td class="org-left">The org-mode file that generated this HTML document</td>
</tr>

<tr>
<td class="org-left"><code>src_42s</code></td>
<td class="org-left">-</td>
<td class="org-left">Ready to convert source listings for 42s code in this document</td>
</tr>

<tr>
<td class="org-left"><code>docs</code></td>
<td class="org-left">-</td>
<td class="org-left">This html document</td>
</tr>

<tr>
<td class="org-left"><code>bin</code></td>
<td class="org-left">-</td>
<td class="org-left">Importable RAW program files</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org648793e" class="outline-2">
<h2 id="org648793e"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
This application might be best described as an image metrology tool with a focus on philatelic applications.  It supports a few standard measurements useful
for philately (length &amp; angle) as well as some specialized functionality for philatelists (perforation measurement, kiusalas gauge conversion, Thirkell &amp;
design coordinates, design size, &amp; parallel edge checks).  While I do most of this kind of work on my laptop with ImageJ (Fiji actually), I frequently use
this calculator application with the digital microscope on my "stamp table" or when I'm away from my laptop.
</p>
</div>
</div>
