src/phil.org
* The Main Menu
:PROPERTIES:
:CUSTOM_ID: menu
:END:

#+ATTR_HTML: :align center
#+NAME: PHIL
| MS          | ML     | Menu       | Description                                               | Require Cal? |
|-------------+--------+------------+-----------------------------------------------------------+--------------|
| LBL 85      | LBL 92 | ANGL       | Angle given complex pixel coordinate                      | Never        |
| LENG:PX>D   | LBL 91 | LENG:PX>D  | Length given real pixel count or complex pixel coordinate | Always       |
| LENG:D>PX   | LBL 66 | LENG:D>PX  | Pixel count given Length or complex coordinate            | Always       |
| LENG:▒▒▒▒   |        | LENG:▒▒▒▒  |                                                           | N/A          |
| LENG:▒▒▒▒   |        | LENG:▒▒▒▒  |                                                           | N/A          |
| LENG:▒▒▒▒   |        | LENG:▒▒▒▒  |                                                           | N/A          |
| LENG:CAL    | LBL 95 | LENG:CAL   | Set or display image calibration                          | Never        |
| QUAD:UL     | LBL 57 | QUAD:UL    |                                                           | Never        |
| QUAD:UR     | LBL 58 | QUAD:UR    |                                                           | Never        |
| QUAD:LR     | LBL 59 | QUAD:LR    |                                                           | Never        |
| QUAD:LL     | LBL 60 | QUAD:LL    |                                                           | Never        |
| QUAD:▒▒▒▒   |        | QUAD:▒▒▒▒  |                                                           | N/A          |
| QUAD:CAL    | LBL 95 | QUAD:CAL   | Set or display image calibration                          | Never        |
| QUAD:∡TB    | LBL 62 | QUAD:∡TB   | Compute angle difference between top an bottom sides      | Never        |
| QUAD:∡LR    | LBL 63 | QUAD:∡LR   | Compute angle difference between left an right sides      | Never        |
| QUAD:WIDE   | LBL 64 | QUAD:WIDE  | Compute width (left, right, average)                      | Always       |
| QUAD:TALL   | LBL 65 | QUAD:TALL  | Compute height (top, bottom, average)                     | Always       |
| QUAD:▒▒▒▒   |        | QUAD:▒▒▒▒  |                                                           | N/A          |
| QUAD:▒▒▒▒   |        | QUAD:▒▒▒▒  |                                                           | N/A          |
| PERF:D<>P   | LBL 96 | PERF:D<>P  | Convert between perforations & distance                   | Only if D=px |
| PERF:P<>K   |        | PERF:P<>K  | Convert between perforations & Kiusalas                   | Never        |
| PERF:LBL 87 | LBL 98 | PERF:C:??  | Set perforation count (C)                                 | Never        |
| PERF:LBL 89 | LBL 99 | PERF:D:??  | Cycle distance units: px mm mil um in cm                  | Never        |
| PERF:LBL 86 | LBL 88 | PERF:I:??  | Cycle image length units when D=px: mm mil um in cm       | Never        |
| PERF:LBL 67 | LBL 95 | PERF:CAL   | Set or display image calibration when when D=px           | Never        |
| DCRD:PX>DC  | LBL 75 | DCRD:PX>DC | Design Coordinate given complex pixel coordinate          | Always       |
| DCRD:DC>PX  | LBL 49 | DCRD:DC>PX | Complex pixel coordinate given Design Coordinate          | Always       |
| DCRD:T>MM   |        | DCRD:T>MM  | Thirkell grid (letter+number) to coord in millimeters     | Never        |
| DCRD:MM>T   |        | DCRD:MM>T  | Coord in millimeters to Thirkell grid (letter+number)     | Never        |
| DCRD:ORIG   | LBL 90 | DCRD:ORIG  |                                                           | N/A          |
| DCRD::CAL   | LBL 95 | DCRD:CAL   | Set or display image calibration                          | Never        |
| CAL         | LBL 95 | CAL        | Set or display image calibration                          | Never        |
|-------------+--------+------------+-----------------------------------------------------------+--------------|

Notes:
  - Please ignore the first two columns in the table -- they are used to auto-generate the menu code for the application.
  - Image calibration is not required all the time -- see the last column of the table
  - In examples I will generally leave off key strokes to get to the correct menu.  i.e. I'll say =[PX>D]= instead of =[LENG] [PX>D]=
  - Parameter setting functions don't drop the stack.  Hitting =[SHIFT]= before one of these keys will report the current value.
  - Functions like =[PX>DC]= that require a complex argument will do a =[COMPLEX]= when given real arguments.

* =[CAL]=: Image Calibration

Note: The =[CAL]= function is located on most menu pages so it is always handy.

Image coordinates are measured in pixels.  The upper left point is pixel $(0, 0)$. X values increase as we move to the right.  Y values increase as we move
*down*.  This is the most common coordinate system used in computer graphics.

This application works with images with square pixels only.  When using a scanner make sure the X & Y DPI settings are the same!

Calibration is retained between runs of the application.  If the application is started up without calibration data, then a default will be set (2400 DIP scan
with units in mm resulting in a calibration factor of 94.4881889764).

** Known DPI

When using a scanner, the scanner DPI settings may be used to roughly calibrate an image.

*** Examples

    - 2400 DPI scans and using inches as the unit:  =2400 [ENTER] 1 [CAL]=
    - 2400 DPI scans and using mm as the unit: =2400 [ENTER] 25.4 [CAL]=
    - 1000 DPcm scans using mm as the unit: =1000 [ENTER] 10 [CAL]=

