docs/phil.html

<div id="outline-container-menu" class="outline-2">
<h2 id="menu"><span class="section-number-2">3</span> The Main Menu</h2>
<div class="outline-text-2" id="text-menu">
<table id="org92c36dc" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">MS</th>
<th scope="col" class="org-right">ML</th>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Require Cal?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">85</td>
<td class="org-right">92</td>
<td class="org-left">ANGL</td>
<td class="org-left">Angle given complex pixel coordinate</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">LENG:PX&gt;D</td>
<td class="org-right">91</td>
<td class="org-left">LENG:PX&gt;D</td>
<td class="org-left">Length given real pixel count or complex pixel coordinate</td>
<td class="org-left">Always</td>
</tr>

<tr>
<td class="org-left">LENG:D&gt;PX</td>
<td class="org-right">66</td>
<td class="org-left">LENG:D&gt;PX</td>
<td class="org-left">Pixel count given Length or complex coordinate</td>
<td class="org-left">Always</td>
</tr>

<tr>
<td class="org-left">LENG:▒▒▒▒</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">LENG:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">N/A</td>
</tr>

<tr>
<td class="org-left">LENG:▒▒▒▒</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">LENG:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">N/A</td>
</tr>

<tr>
<td class="org-left">LENG:▒▒▒▒</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">LENG:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">N/A</td>
</tr>

<tr>
<td class="org-left">LENG:CAL</td>
<td class="org-right">95</td>
<td class="org-left">LENG:CAL</td>
<td class="org-left">Set or display image calibration</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">QUAD:UL</td>
<td class="org-right">57</td>
<td class="org-left">QUAD:UL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">QUAD:UR</td>
<td class="org-right">58</td>
<td class="org-left">QUAD:UR</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">QUAD:LR</td>
<td class="org-right">59</td>
<td class="org-left">QUAD:LR</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">QUAD:LL</td>
<td class="org-right">60</td>
<td class="org-left">QUAD:LL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">QUAD:▒▒▒▒</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">QUAD:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">N/A</td>
</tr>

<tr>
<td class="org-left">QUAD:CAL</td>
<td class="org-right">95</td>
<td class="org-left">QUAD:CAL</td>
<td class="org-left">Set or display image calibration</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">QUAD:∡TB</td>
<td class="org-right">62</td>
<td class="org-left">QUAD:∡TB</td>
<td class="org-left">Compute angle difference between top an bottom sides</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">QUAD:∡LR</td>
<td class="org-right">63</td>
<td class="org-left">QUAD:∡LR</td>
<td class="org-left">Compute angle difference between left an right sides</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">QUAD:WIDE</td>
<td class="org-right">64</td>
<td class="org-left">QUAD:WIDE</td>
<td class="org-left">Compute width (left, right, average)</td>
<td class="org-left">Always</td>
</tr>

<tr>
<td class="org-left">QUAD:TALL</td>
<td class="org-right">65</td>
<td class="org-left">QUAD:TALL</td>
<td class="org-left">Compute height (top, bottom, average)</td>
<td class="org-left">Always</td>
</tr>

<tr>
<td class="org-left">QUAD:▒▒▒▒</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">QUAD:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">N/A</td>
</tr>

<tr>
<td class="org-left">QUAD:▒▒▒▒</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">QUAD:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">N/A</td>
</tr>

<tr>
<td class="org-left">PERF:D&lt;&gt;P</td>
<td class="org-right">96</td>
<td class="org-left">PERF:D&lt;&gt;P</td>
<td class="org-left">Convert between perforations &amp; distance</td>
<td class="org-left">Only if D=px</td>
</tr>

<tr>
<td class="org-left">PERF:P&lt;&gt;K</td>
<td class="org-right">97</td>
<td class="org-left">PERF:P&lt;&gt;K</td>
<td class="org-left">Convert between perforations &amp; Kiusalas</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">PERF:87</td>
<td class="org-right">98</td>
<td class="org-left">PERF:C:??</td>
<td class="org-left">Set perforation count (C)</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">PERF:89</td>
<td class="org-right">99</td>
<td class="org-left">PERF:D:??</td>
<td class="org-left">Cycle distance units: px mm mil um in cm</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">PERF:86</td>
<td class="org-right">88</td>
<td class="org-left">PERF:I:??</td>
<td class="org-left">Cycle image length units when D=px: mm mil um in cm</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">PERF:67</td>
<td class="org-right">95</td>
<td class="org-left">PERF:CAL</td>
<td class="org-left">Set or display image calibration when when D=px</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">DCRD:PX&gt;DC</td>
<td class="org-right">75</td>
<td class="org-left">DCRD:PX&gt;DC</td>
<td class="org-left">Design Coordinate given complex pixel coordinate</td>
<td class="org-left">Always</td>
</tr>

<tr>
<td class="org-left">DCRD:DC&gt;PX</td>
<td class="org-right">49</td>
<td class="org-left">DCRD:DC&gt;PX</td>
<td class="org-left">Complex pixel coordinate given Design Coordinate</td>
<td class="org-left">Always</td>
</tr>

<tr>
<td class="org-left">DCRD:T&gt;MM</td>
<td class="org-right">43</td>
<td class="org-left">DCRD:T&gt;MM</td>
<td class="org-left">Thirkell grid (letter+number) to coord in millimeters</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">DCRD:MM&gt;T</td>
<td class="org-right">48</td>
<td class="org-left">DCRD:MM&gt;T</td>
<td class="org-left">Coord in millimeters to Thirkell grid (letter+number)</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">DCRD:ORIG</td>
<td class="org-right">90</td>
<td class="org-left">DCRD:ORIG</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">N/A</td>
</tr>

<tr>
<td class="org-left">DCRD::CAL</td>
<td class="org-right">95</td>
<td class="org-left">DCRD:CAL</td>
<td class="org-left">Set or display image calibration</td>
<td class="org-left">Never</td>
</tr>

<tr>
<td class="org-left">CAL</td>
<td class="org-right">95</td>
<td class="org-left">CAL</td>
<td class="org-left">Set or display image calibration</td>
<td class="org-left">Never</td>
</tr>
</tbody>
</table>

<p>
Notes:
</p>
<ul class="org-ul">
<li>Please ignore the first two columns in the table &#x2013; they are used to auto-generate the menu code for the application.</li>
<li>Image calibration is not required all the time &#x2013; see the last column of the table</li>
<li>In examples I will generally leave off key strokes to get to the correct menu.  i.e. I'll say <code>[PX&gt;D]</code> instead of <code>[LENG] [PX&gt;D]</code></li>
<li>Most functions don't drop the stack.  They just push results onto the stack.</li>
<li>Some functions, like <code>[PX&gt;DC]</code>, may take one or two arguments depending upon what is on the stack when the function is executed.</li>
</ul>
</div>
</div>

<div id="outline-container-org226ce8d" class="outline-2">
<h2 id="org226ce8d"><span class="section-number-2">4</span> <code>[CAL]</code>: Image Calibration</h2>
<div class="outline-text-2" id="text-4">
<p>
Note: The <code>[CAL]</code> function is located on most menu pages so it is always handy.
</p>

<p>
Image coordinates are measured in pixels.  The upper left point is pixel (0, 0).  X values increase as we move to the right.  Y values increase as we move
<b>down</b>.  This is the most common coordinate system used in computer graphics.
</p>

<p>
This application works with images with square pixels only.  When using a scanner make sure the X &amp; Y DPI settings are the same!
</p>

<p>
Calibration is retained between runs of the application.  If the application is started up without calibration data, then a default will be set (2400 DIP scan
with units in mm resulting in a calibration factor of 94.4881889764).
</p>
</div>

<div id="outline-container-orgb718c87" class="outline-3">
<h3 id="orgb718c87"><span class="section-number-3">4.1</span> Known DPI</h3>
<div class="outline-text-3" id="text-4-1">
<p>
When using a scanner, the scanner DPI settings may be used to roughly calibrate an image.
</p>
</div>

<div id="outline-container-orgb831e2e" class="outline-4">
<h4 id="orgb831e2e"><span class="section-number-4">4.1.1</span> Examples</h4>
<div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li>2400 DPI scans and using inches as the unit:  <code>2400 [ENTER] 1 [CAL]</code></li>
<li>2400 DPI scans and using mm as the unit: <code>2400 [ENTER] 25.4 [CAL]</code></li>
<li>1000 DPcm scans using mm as the unit: <code>1000 [ENTER] 10 [CAL]</code></li>
</ul>
</div>
</div>
</div>
