src/phil.org
** Using a target

Including a calibration target in the image field is the most common way to calibrate microscope images.  For high magnification expensive, etched glass
reticle are generally used.  For the lower magnifications normally used my stamp collectors, a simple scale may be included in the image frame.  I simply lay
the stamps on top of a plastic ruler.

When using a calibration target it is rare that the target is precisely lined up horizontally or vertically, so providing a simple pixel count for it's length
is impossible.  Instead we provide the pixel coordinates of two points on the target.

*** Example

We have a 1mm ruler in the frame.  The 0 mark of the ruler is at pixel coordinates (123, 456) and the 3 mark of the ruler is at pixel coordinates (567, 345).
If we wish to work directly in mm, then we do this:

  - Enter the 0 coordinate: =123 [ENTER] 456 [COMPLEX]=  -- assuming "=RECT=" mode
  - Enter the 1 coordinate: =234 [ENTER] 345 [COMPLEX]=
  - Enter physical distance: =3=
  - Press the CAL menu key: =[CAL]=

If we wanted to work in cm instead of mm, we would use a distance of =0.3= instead.

If we wanted to work in mil instead of mm, we would use a distance of =118.11= instead

** Using a Stamp!

The techniques documented here can be very useful, but must be used with care.  Stamp paper can warp and deform -- depending on printing process, storage
conditions, etc...

Suppose you have an image of a stamp (perhaps from an auction website) that should have an design width of 22mm.  You determine the upper left of the design
is at pixel coordinates (300, 100), and the upper right of the design is at pixel coordinates (536, 101).  Also suppose you wish to work in inches (you will
see why in a moment):

=322 [ENTER] 125 [COMPLEX] 582 [ENTER] 126 [COMPLEX] [-] 22 [ENTER] 25.4 [÷] [CAL]=

Now notice the value on the screen is =300.1840=.  Many stamp images posted on auction sites are scanned at 300 DPI, and the fact this is so close to 300
tells us that we probably have a 300 DPI scan.  We can now use 300 as our calibration data, or use the computed value.

You can use this technique with any feature of a stamp with a known measurement -- not just design size.  For example, some souvenir sheets have very precise
paper sizes allowing the width or height of the paper to be used for calibration.

The perforations may also be used as a calibration aid.  For example if we know the stamp in question has a perforation of 70 on the Kiusalas gauge, then we
know 10 perforations should measure very close to 16mm.

** Calibration factor

The "calibration factor", returned by =[SHIFT] [CAL]=, is the current image calibration data in units of pixels/length.

*** Examples

    - 2400 DPI scans and using inches as the unit: 2400
    - 2400 DPI scans and using mm as the unit: 94.4881889764
    - 1000 DPcm scans using mm as the unit: 100

* =[LENG]=: Measuring lengths
** Horizontal or Vertical Lengths

For horizontal & vertical lengths in the image, one simply needs to provided a pixel count as a real number.

For stamps it can be handy to rotate the image so that interesting lengths are at 0 or 90 degrees.  For example, when working with US Washington-Franklin
issues it is a good idea to line up the design frame with the horizontal.

*** Examples

   - 2400 DPI image working in inches:
     - =1200 [PX>D]= → 0.5
     - =2400 [PX>D]= → 1.0
   - The same image working in mm:
     - =1200 [PX>D]= → 12.7
     - =2400 [PX>D]= → 25.4

** Generic distances

To measure the length of a non-horizontal/vertical line, we provide a complex number to the =[PX>D]= function.  One might think of the coordinates as
specifying a line from the origin, upper left image pixel at (0, 0), to the given coordinates.  Alternately one might think of the coordinates as the width &
height of the line.  The signs of the coordinates are ignored -- i.e. the absolute value of each coordinate is used.

#+begin_src text
                * P2  -            (0, 0) *
               /      |                    \
              /       |                     \
             /        h                      \
            /         |                       \
           /          |                        \
      P1  *           -                         * (x, y)
          |--w--|
#+end_src

To measure the length of a line segment given by two points, we simply enter both points as complex numbers and subtract them.  We then give the difference to
the =[PX>D]= function.

*** Examples

  - For a 2400 DPI image working in mm (=2400 [ENTER] 25.4 [CAL]=):
    - =123 [ENTER] 456 [COMPLEX] 234 [ENTER] 345 [COMPLEX] [-] [PX>D]= → 1.7300 mm
  - For a 2400 DPI image working in inches (=2400 [ENTER] 1 [CAL]=):
    - =1 [ENTER] 1 [COMPLEX] 100 [ENTER] 100 [COMPLEX] [-] [PX>D]= → 0.0583 in
  - To compute the length in raw pixels, set cal to 1 (=1 [ENTER] [CAL]=):
    - =1 [ENTER] 1 [COMPLEX] 100 [ENTER] 100 [COMPLEX] [PX>D]= → 140.0 PX

** Philatelic Application: Rotary Press vs. Flat Plate (Take 1)

For an alternative approach see: [[Philatelic Application: Rotary Press vs. Flat Plate (Take 2)][Philatelic Application: Rotary Press vs. Flat Plate (Take 2)]]

*** Example 1

Scenario: We have a Washington-Franklin, and we would like to know if it was printed on a rotary press.  We have a 2400 DPI scan.

For reference, here are the measurements for the various printing options:
#+ATTR_HTML: :align center
| Press    | Width     | Height    |
|----------+-----------+-----------|
| Flat     | 18.5-19mm | 22mm      |
| Rot Vert | 18.5-19mm | 22.5-23mm |
| Rot Horz | 19.5-20mm | 22mm      |

