docs/phil.html

<div id="outline-container-org0fb0a77" class="outline-3">
<h3 id="org0fb0a77"><span class="section-number-3">4.2</span> Using a target</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Including a calibration target in the image field is the most common way to calibrate microscope images.  For high magnification expensive, etched glass
reticle are generally used.  For the lower magnifications normally used my stamp collectors, a simple scale may be included in the image frame.  I simply lay
the stamps on top of a plastic ruler.
</p>

<p>
When using a calibration target it is rare that the target is precisely lined up horizontally or vertically, so providing a simple pixel count for it's length
is impossible.  Instead we provide the pixel coordinates of two points on the target.
</p>
</div>

<div id="outline-container-orgc07cb52" class="outline-4">
<h4 id="orgc07cb52"><span class="section-number-4">4.2.1</span> Example</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
We have a 1mm ruler in the frame.  The 0 mark of the ruler is at pixel coordinates (123, 456) and the 3 mark of the ruler is at pixel coordinates (567, 345).
If we wish to work directly in mm, then we do this:
</p>

<ul class="org-ul">
<li>Enter the 0 coordinate: <code>123 [ENTER] 456 [COMPLEX]</code>  &#x2013; assuming "<code>RECT</code>" mode</li>
<li>Enter the 1 coordinate: <code>234 [ENTER] 345 [COMPLEX]</code></li>
<li>Enter physical distance: <code>3</code></li>
<li>Press the CAL menu key: <code>[CAL]</code></li>
</ul>

<p>
If we wanted to work in cm instead of mm, we would use a distance of <code>0.3</code> instead.
</p>

<p>
If we wanted to work in mil instead of mm, we would use a distance of <code>118.11</code> instead
</p>
</div>
</div>
</div>

<div id="outline-container-orgf54c510" class="outline-3">
<h3 id="orgf54c510"><span class="section-number-3">4.3</span> Using a Stamp!</h3>
<div class="outline-text-3" id="text-4-3">
<p>
The techniques documented here can be very useful, but must be used with care.  Stamp paper can warp and deform &#x2013; depending on printing process, storage
conditions, etc&#x2026;
</p>

<p>
Suppose you have an image of a stamp (perhaps from an auction website) that should have an design width of 22mm.  You determine the upper left of the design
is at pixel coordinates (300, 100), and the upper right of the design is at pixel coordinates (536, 101).  Also suppose you wish to work in inches (you will
see why in a moment):
</p>

<p>
<code>322 [ENTER] 125 [COMPLEX] 582 [ENTER] 126 [COMPLEX] [-] 22 [ENTER] 25.4 [÷] [CAL]</code>
</p>

<p>
Now notice the value on the screen is <code>300.1840</code>.  Many stamp images posted on auction sites are scanned at 300 DPI, and the fact this is so close to 300
tells us that we probably have a 300 DPI scan.  We can now use 300 as our calibration data, or use the computed value.
</p>

<p>
You can use this technique with any feature of a stamp with a known measurement &#x2013; not just design size.  For example, some souvenir sheets have very precise
paper sizes allowing the width or height of the paper to be used for calibration.
</p>

<p>
The perforations may also be used as a calibration aid.  For example if we know the stamp in question has a perforation of 70 on the Kiusalas gauge, then we
know 10 perforations should measure very close to 16mm.
</p>
</div>
</div>

<div id="outline-container-orge714d10" class="outline-3">
<h3 id="orge714d10"><span class="section-number-3">4.4</span> Calibration factor</h3>
<div class="outline-text-3" id="text-4-4">
<p>
The "calibration factor", returned by <code>[SHIFT] [CAL]</code>, is the current image calibration data in units of pixels/length.
</p>
</div>

<div id="outline-container-org502112e" class="outline-4">
<h4 id="org502112e"><span class="section-number-4">4.4.1</span> Examples</h4>
<div class="outline-text-4" id="text-4-4-1">
<ul class="org-ul">
<li>2400 DPI scans and using inches as the unit: 2400</li>
<li>2400 DPI scans and using mm as the unit: 94.4881889764</li>
<li>1000 DPcm scans using mm as the unit: 100</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org684694c" class="outline-2">
<h2 id="org684694c"><span class="section-number-2">5</span> <code>[LENG]</code>: Measuring lengths</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgc00aaab" class="outline-3">
<h3 id="orgc00aaab"><span class="section-number-3">5.1</span> Horizontal or Vertical Lengths</h3>
<div class="outline-text-3" id="text-5-1">
<p>
For horizontal &amp; vertical lengths in the image, one simply needs to provided a pixel count as a real number.
</p>

<p>
For stamps it can be handy to rotate the image so that interesting lengths are at 0 or 90 degrees.  For example, when working with US Washington-Franklin
issues it is a good idea to line up the design frame with the horizontal.
</p>
</div>

<div id="outline-container-org103acd6" class="outline-4">
<h4 id="org103acd6"><span class="section-number-4">5.1.1</span> Examples</h4>
<div class="outline-text-4" id="text-5-1-1">
<ul class="org-ul">
<li>2400 DPI image working in inches:
<ul class="org-ul">
<li><code>1200 [PX&gt;D]</code> → 0.5</li>
<li><code>2400 [PX&gt;D]</code> → 1.0</li>
</ul></li>
<li>The same image working in mm:
<ul class="org-ul">
<li><code>1200 [PX&gt;D]</code> → 12.7</li>
<li><code>2400 [PX&gt;D]</code> → 25.4</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb996af6" class="outline-3">
<h3 id="orgb996af6"><span class="section-number-3">5.2</span> Generic distances</h3>
<div class="outline-text-3" id="text-5-2">
<p>
To measure the length of a non-horizontal/vertical line, we provide a complex number to the <code>[PX&gt;D]</code> function.  One might think of the coordinates as
specifying a line from the origin, upper left image pixel at (0, 0), to the given coordinates.  Alternately one might think of the coordinates as the width &amp;
height of the line.  The signs of the coordinates are ignored &#x2013; i.e. the absolute value of each coordinate is used.
</p>

<pre class="example" id="org85b1307">
          * P2  -            (0, 0) *
         /      |                    \
        /       |                     \
       /        h                      \
      /         |                       \
     /          |                        \
P1  *           -                         * (x, y)
    |--w--|
</pre>

<p>
To measure the length of a line segment given by two points, we simply enter both points as complex numbers and subtract them.  We then give the difference to
the <code>[PX&gt;D]</code> function.
</p>
</div>

<div id="outline-container-org02f111a" class="outline-4">
<h4 id="org02f111a"><span class="section-number-4">5.2.1</span> Examples</h4>
<div class="outline-text-4" id="text-5-2-1">
<ul class="org-ul">
<li>For a 2400 DPI image working in mm (<code>2400 [ENTER] 25.4 [CAL]</code>):
<ul class="org-ul">
<li><code>123 [ENTER] 456 [COMPLEX] 234 [ENTER] 345 [COMPLEX] [-] [PX&gt;D]</code> → 1.7300 mm</li>
</ul></li>
<li>For a 2400 DPI image working in inches (<code>2400 [ENTER] 1 [CAL]</code>):
<ul class="org-ul">
<li><code>1 [ENTER] 1 [COMPLEX] 100 [ENTER] 100 [COMPLEX] [-] [PX&gt;D]</code> → 0.0583 in</li>
</ul></li>
<li>To compute the length in raw pixels, set cal to 1 (<code>1 [ENTER] [CAL]</code>):
<ul class="org-ul">
<li><code>1 [ENTER] 1 [COMPLEX] 100 [ENTER] 100 [COMPLEX] [PX&gt;D]</code> → 140.0 PX</li>
</ul></li>
</ul>
</div>
</div>
</div>
