src/phil.org
**** Method 1 (Stamp design not aligned)

We begin by locating the coordinates for three frame corners:
#+ATTR_HTML: :align center
|-------------+-------------|
| Corner      | Coordinates |
|-------------+-------------|
| Upper left  | (150, 160)  |
| Upper right | (1903, 161) |
| Lower left  | (149, 2239) |
|-------------+-------------|

  - Calibration.  If we have not already calibrated, we need to do that first
    - =2400 25.4 [CAL]=
  - Now we compute the width of our stamp design
    - =150 [ENTER] 160 [COMPLEX] [ENTER] [ENTER] 1903 [ENTER] 161 [COMPLEX] [-] [PX>D]= → 18.55 mm
    - Note we duplicated the first coordinate so we can use it later...
  - Now we compute the height of our stamp design
    - =[X<>Y] 149 [ENTER] 2239 [COMPLEX] [-] [PX>D]= → 22.00 mm

Our stamp is 18.55mm x 22.00mm -- and so it must be a flat plate stamp.

**** Method 2 (Stamp design aligned)

In this case the lower and upper frame lines of the design are perfectly horizontal.  In this
case we only need two points.

We begin by locating the coordinates for three frame corners (UL & LR, or UR & LL):

#+ATTR_HTML: :align center
|-------------+--------------|
| Corner      | Coordinates  |
|-------------+--------------|
| Upper left  | (150, 160)   |
| Lower right | (1902, 2240) |
|-------------+--------------|

  - Calibration.  If we have not already calibrated, we need to do that first
    - =2400 25.4 [CAL]=
  - Now we compute the width of our stamp design
    - =150 [ENTER] 160 [COMPLEX] 1902 [ENTER] 2240 [COMPLEX] [-] [COMPLEX] [PX>D]= → 22.01mm
  - Now we compute the width of our stamp design
    - =[Rv] [Rv] [PX>D]= → 18.54mm

Our stamp is 18.54mm x 22.01mm -- and so it must be a flat plate stamp.

* =[PERF]=: Measuring & Converting Perforations

Perforations are usually measured in units of perfs/2cm; however, other units are used in some specialized areas of philately.  For example, the Kiusalas
gauge measures perforations in units of mil/perf -- a more natural measure for USPS bureau issues.  This application provides tools to convert between
standard perforations and Kiusalas perforations (=[P<>K]=).

Also provided is a way to approximate standard perforation measurement by measuring the distance (D) spanned by a number of perforations (C).

Below is an illustration of how to measure distance and count perforations.  First pick a recognizable feature in your starting and ending perforations, and
measure the distance between them.  The first distance in the illustration measures the distance between "perf bottoms".  Take careful note of how we count
-- the number of "bottoms" in this case.

#+begin_src text
##                                                                                                              ##
##      | . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . |     ##
##      |. . . . . . . . . . . . . . . . . . . . . . C = 4 . . . . . . . . . . . . . . . . . . . . . . . .|     ##
##      | . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . |     ##
##      |. . . . . ------- . . . . . . . .-------. . . . . . . . ------- . . . . . . . .-------. . . . . .|     ##
##      | . . . .-/       \-. . . . . . -/       \- . . . . . .-/       \-. . . . . . -/       \- . . . . |     ##
##      |. . . ./           \. . . . . /           \ . . . . ./           \. . . . . /           \ . . . .|     ##
##      | . . ./      1      \. . . . /      2      \ . . . ./      3      \. . . . /      4      \ . . . |     ##
##      |. . . |             | . . . .|             |. . . . |             | . . . .|             |. . . .|     ##
##      +------+             +--------+             +--------+             +--------+             +-------+     ##
##                    |--------------------------- D = Distance ---------------------------|                    ##
##             |--------------------------- D = Distance ---------------------------|                           ##
##                           |--------------------------- D = Distance ---------------------------|             ##
##                                                                                                              ##
#+end_src

Distance ($D$), perforation count ($C$), traditional perforations ($P$) measured in perfs/2cm, and Kiusalas perforations ($K$) measured in mil/perf are
related:

$$ K = \frac{5000 D}{127 (C - 1)} $$
$$ P = \frac{20 (C - 1)}{D} $$
$$ P = \frac{100000}{127 K} $$

*** Example: Measuring Standard & Kiusalas Perforations

Scenario: We have a Washington-Franklin that should be perforated Kiusalas 70, and we wish to verify perfs.  We have a 2400 DPI scan.

We find the coordinate of the first perf bottom at (150, 160) and 10 perfs over we have another bottom at (1662, 161).

  - Calibration.  If we have not already calibrated, we need to do that first
    - =2400 25.4 [CAL]=
  - Now we compute our perfs
    - =150 [ENTER] 160 [COMPLEX] 1662 [ENTER] 161 [COMPLEX] [D<>P]= → 11.24859
  - Next we compute the Kiusalas value
    - =[P<>K]= → 70.0000

And it looks like our stamp really is perforated Kiusalas 70!

* =[ANGL]=: Measuring Angles

Angles are measured with respect the horizontal -- the /negative/ of the argument of the complex number representing the pixel coordinate.  We use the
negative because pixel y-coordinates go up in the down direction.

TIP: =[ANGL]= requires a complex number.  If you give it something else it will call =COMPLEX= to convert the lower two stack levels into a complex number.
This saves the user two key presses -- i.e. you don't have to hit =[SHIFT] [COMPLEX]= to convert to complex before you use =[ANGL]=.

