docs/phil.html

<div id="outline-container-org6b47821" class="outline-3">
<h3 id="org6b47821"><span class="section-number-3">5.3</span> Philatelic Application: Rotary Press vs. Flat Plate (Take 1)</h3>
<div class="outline-text-3" id="text-5-3">
<p>
For an alternative approach see: <a href="#orgf3246a3">Philatelic Application: Rotary Press vs. Flat Plate (Take 2)</a>
</p>
</div>

<div id="outline-container-org86a709b" class="outline-4">
<h4 id="org86a709b"><span class="section-number-4">5.3.1</span> Example 1</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
Scenario: We have a Washington-Franklin, and we would like to know if it was printed on a rotary press.  We have a 2400 DPI scan.
</p>

<p>
For reference, here are the measurements for the various printing options:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Press</th>
<th scope="col" class="org-left">Width</th>
<th scope="col" class="org-left">Height</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Flat</td>
<td class="org-left">18.5-19mm</td>
<td class="org-left">22mm</td>
</tr>

<tr>
<td class="org-left">Rot Vert</td>
<td class="org-left">18.5-19mm</td>
<td class="org-left">22.5-23mm</td>
</tr>

<tr>
<td class="org-left">Rot Horz</td>
<td class="org-left">19.5-20mm</td>
<td class="org-left">22mm</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orge468106" class="outline-5">
<h5 id="orge468106"><span class="section-number-5">5.3.1.1</span> Method 1 (Stamp design not aligned)</h5>
<div class="outline-text-5" id="text-5-3-1-1">
<p>
We begin by locating the coordinates for three frame corners:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Corner</th>
<th scope="col" class="org-left">Coordinates</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Upper left</td>
<td class="org-left">(150, 160)</td>
</tr>

<tr>
<td class="org-left">Upper right</td>
<td class="org-left">(1903, 161)</td>
</tr>

<tr>
<td class="org-left">Lower left</td>
<td class="org-left">(149, 2239)</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Calibration.  If we have not already calibrated, we need to do that first
<ul class="org-ul">
<li><code>2400 25.4 [CAL]</code></li>
</ul></li>
<li>Now we compute the width of our stamp design
<ul class="org-ul">
<li><code>150 [ENTER] 160 [COMPLEX] [ENTER] [ENTER] 1903 [ENTER] 161 [COMPLEX] [-] [PX&gt;D]</code> → 18.55 mm</li>
<li>Note we duplicated the first coordinate so we can use it later&#x2026;</li>
</ul></li>
<li>Now we compute the height of our stamp design
<ul class="org-ul">
<li><code>[Rv] [Rv] 149 [ENTER] 2239 [COMPLEX] [-] [PX&gt;D]</code> → 22.00 mm</li>
</ul></li>
</ul>

<p>
Our stamp is 18.55mm x 22.00mm &#x2013; and so it must be a flat plate stamp.
</p>
</div>
</div>

<div id="outline-container-orge515d5d" class="outline-5">
<h5 id="orge515d5d"><span class="section-number-5">5.3.1.2</span> Method 2 (Stamp design aligned)</h5>
<div class="outline-text-5" id="text-5-3-1-2">
<p>
In this case the lower and upper frame lines of the design are perfectly horizontal.  In this
case we only need two points.
</p>

<p>
We begin by locating the coordinates for three frame corners (UL &amp; LR, or UR &amp; LL):
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Corner</th>
<th scope="col" class="org-left">Coordinates</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Upper left</td>
<td class="org-left">(150, 160)</td>
</tr>

<tr>
<td class="org-left">Lower right</td>
<td class="org-left">(1902, 2240)</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Calibration.  If we have not already calibrated, we need to do that first
<ul class="org-ul">
<li><code>2400 25.4 [CAL]</code></li>
</ul></li>
<li>Now we compute the width of our stamp design
<ul class="org-ul">
<li><code>150 [ENTER] 160 [COMPLEX] 1902 [ENTER] 2240 [COMPLEX] [-] [COMPLEX] [PX&gt;D]</code> → 22.01mm</li>
</ul></li>
<li>Now we compute the width of our stamp design
<ul class="org-ul">
<li><code>[Rv] [Rv] [PX&gt;D]</code> → 18.54mm</li>
</ul></li>
</ul>

<p>
Our stamp is 18.54mm x 22.01mm &#x2013; and so it must be a flat plate stamp.
</p>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org149b52e" class="outline-2">
<h2 id="org149b52e"><span class="section-number-2">6</span> <code>[PERF]</code>: Measuring &amp; Converting Perforations</h2>
<div class="outline-text-2" id="text-6">
<p>
Perforations are usually measured in units of perfs/2cm; however, other units are used in some specialized areas of philately.  For example, the Kiusalas
gauge measures perforations in units of mil/perf &#x2013; a more natural measure for USPS bureau issues.  This application provides tools to convert between
standard perforations and Kiusalas perforations (<code>[P&lt;&gt;K]</code>).
</p>

<p>
Also provided is a way to approximate standard perforation measurement by measuring the distance (D) spanned by a number of perforations (C).
</p>

<p>
Below is an illustration of how to measure distance and count perforations.  First pick a recognizable feature in your starting and ending perforations, and
measure the distance between them.  The first distance in the illustration measures the distance between "perf bottoms".  Take careful note of how we count
&#x2013; the number of "bottoms" in this case.
</p>

<div class="org-src-container">
<pre class="src src-text">##                                                                                                              ##
##      | . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . |     ##
##      |. . . . . . . . . . . . . . . . . . . . . . C = 4 . . . . . . . . . . . . . . . . . . . . . . . .|     ##
##      | . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . |     ##
##      |. . . . . ------- . . . . . . . .-------. . . . . . . . ------- . . . . . . . .-------. . . . . .|     ##
##      | . . . .-/       \-. . . . . . -/       \- . . . . . .-/       \-. . . . . . -/       \- . . . . |     ##
##      |. . . ./           \. . . . . /           \ . . . . ./           \. . . . . /           \ . . . .|     ##
##      | . . ./      1      \. . . . /      2      \ . . . ./      3      \. . . . /      4      \ . . . |     ##
##      |. . . |             | . . . .|             |. . . . |             | . . . .|             |. . . .|     ##
##      +------+             +--------+             +--------+             +--------+             +-------+     ##
##                    |--------------------------- D = Distance ---------------------------|                    ##
##             |--------------------------- D = Distance ---------------------------|                           ##
##                           |--------------------------- D = Distance ---------------------------|             ##
##                                                                                                              ##
</pre>
</div>

<p>
Distance (\(D\)), perforation count (\(C\)), traditional perforations (\(P\)) measured in perfs/2cm, and Kiusalas perforations (\(K\)) measured in mil/perf are
related:
</p>

<p>
\[ K = \frac{5000 D}{127 (C - 1)} \]
\[ P = \frac{20 (C - 1)}{D} \]
\[ P = \frac{100000}{127 K} \]
</p>
</div>

<div id="outline-container-org4538b3f" class="outline-4">
<h4 id="org4538b3f"><span class="section-number-4">6.0.1</span> Example: Measuring Standard &amp; Kiusalas Perforations</h4>
<div class="outline-text-4" id="text-6-0-1">
<p>
Scenario: We have a Washington-Franklin that should be perforated Kiusalas 70, and we wish to verify perfs.  We have a 2400 DPI scan.
</p>

<p>
We find the coordinate of the first perf bottom at (150, 160) and 10 perfs over we have another bottom at (1662, 161).
</p>

<ul class="org-ul">
<li>Calibration.  If we have not already calibrated, we need to do that first
<ul class="org-ul">
<li><code>2400 25.4 [CAL]</code></li>
</ul></li>
<li>Now we compute our perfs
<ul class="org-ul">
<li><code>150 [ENTER] 160 [COMPLEX] 1662 [ENTER] 161 [COMPLEX] [D&lt;&gt;P]</code> → 11.24859</li>
</ul></li>
<li>Next we compute the Kiusalas value
<ul class="org-ul">
<li><code>[P&lt;&gt;K]</code> → 70.0000</li>
</ul></li>
</ul>

<p>
And it looks like our stamp really is perforated Kiusalas 70!
</p>
</div>
</div>
</div>

<div id="outline-container-org10bb178" class="outline-2">
<h2 id="org10bb178"><span class="section-number-2">7</span> <code>[ANGL]</code>: Measuring Angles</h2>
<div class="outline-text-2" id="text-7">
<p>
Angles are measured with respect the horizontal &#x2013; the <i>negative</i> of the argument of the complex number representing the pixel coordinate.  We use the
negative because pixel y-coordinates go up in the down direction.
</p>

<p>
TIP: <code>[ANGL]</code> requires a complex number.  If you give it something else it will call <code>COMPLEX</code> to convert the lower two stack levels into a complex number.
This saves the user two key presses &#x2013; i.e. you don't have to hit <code>[SHIFT] [COMPLEX]</code> to convert to complex before you use <code>[ANGL]</code>.
</p>
</div>
