src/phil.org
** Examples

  - =123 [ENTER] 123 [COMPLEX] [ANGLE]= → -45 -- assuming degree angle mode

** Philatelic Application: Parallel Lines (Take 1)

For an alternative approach see: [[Philatelic Application: Parallel Lines (Take 2)][Philatelic Application: Parallel Lines (Take 2)]].

Why?
  - Verify that the two cut edges of a US coil stamp are parallel
  - Verify that perforations are parallel
  - Verify that the cut edge of a souvenir sheet is parallel with an engraved margin line
  - Verify that design edges are parallel -- to make sure an image has no perspective distortion

*** Example

#+begin_src text
     P1 *    * P3                                       P1 *    * P3
        |    |              P1 *-----* P2                 /    /
        |    |      _OR_                     _OR_        /    /
        |    |              P3 *-----* P4               /    /
     P2 *    * P4                                   P2 *    * P4
#+end_src

  - Angle 1: =P1.x [ENTER] P1.y [COMPLEX] P2.x [ENTER] P2.y [COMPLEX] [-] [ANGLE] [STO 00]=
  - Angle 2: =P3.x [ENTER] P3.y [COMPLEX] P4.x [ENTER] P4.y [COMPLEX] [-] [ANGLE] [STO 00]=
  - Difference: =[RCL- 00] [ABS]=

The result will be the absolute angle by which the two lines differ -- i.e. if we have parallel lines it should be 0.

* =[DCRD]=: Design Coordinates

Design Coordinates are used to locate points on a stamp referenced to the design.  A few different schemes are in use with the /"Thirkell" philatelic position
finder/ probably the most popular.  Most of these systems work the same way.  They use the upper left corner of the stamp design as the /origin/ of a
coordinate system -- i.e. they measure distance to the right and down from the upper left corner of the design.  The most common unit of measurement is
millimeters; however, a few also add a grid system on top.  For example the Thirkell uses a 3mm grid.


#+begin_src text
 +^^^^^^^^^^^^^^^^^^^^^^^^+
 (          * P3          )
 (   O *------------+     ) 
 (     |            |     )   - Design coordinates are used locate points on the stamp
 (     |            |     )    - for a point (x,y) is (x-O_x, y-O_y)
 (     |   * P1     |     )    - The most common units are mm
 (     |            |     )    - Axis orientation: Coordinate values get bigger to the right or down
 (     |            |     )    - These kinds of coordinates are frequently used to locate plate flaws                                                               
 (     |            |     )  - Special cases                                                                                                                        
 (     +------------+     )    - Points above or to the left of O will have negative coordinates -- Ex: P3                                                          
 (                   P2 * )    - Points need not be inside the design -- Ex: P2 & P3                                                                                  
 +vvvvvvvvvvvvvvvvvvvvvvvv+
#+end_src

When working with design coordinates you must first tell the application the coordinates of the /origin/ by entering a complex number representing the pixel
coordinates of the upper left corner of the design and hitting the =[ORIG]= button.  If you shift press this button then it will display the current origin.

Now you can convert pixel coordinates to and from design coordinates.

Two functions are also available to convert standard millimeter design coordinates to and from Thirkell coordinates: =[MM>T]= & =[T>MM]=.  Note that Thirkell
coordinates are reversed -- i.e. the first coordinate (the letter) is on the vertical axis and the second coordinate (the integer) is on the horizontal axis.
These functions work in millimeters directly, and do *not* require the image to be calibrated; however, if you wish to use these functions in concert with
=[PX>DC]= & =[DC>PX]= then you must calibrate your image and work in millimeters!

TIP: =[MM>T]=, =[PX>DC]= & =[DC>PX]= require a complex number.  If you provide something else they will call =COMPLEX= to convert the lower two stack levels
into a complex number.  This saves the user two key presses -- i.e. you don't have to hit =[SHIFT] [COMPLEX]= to convert to complex before you use =[ANGL]=.

** Example

Scenario: You wish to report a new plate flaw to the nice people that make the /Zumstein/ catalog using the Thirkell grid.  We have a 2400 DPI scan.  

First we locate the upper left hand corner of the design and our plate flaw:

#+ATTR_HTML: :align center
|-----------------------------+-------------------|
| Item                        | Pixel Coordinates |
|-----------------------------+-------------------|
| Upper left corner of design | (150, 160)        |
| Center of our plate flaw    | (713, 956)        |
|-----------------------------+-------------------|

  - Calibration.  If we have not already calibrated, we need to do that first
    - =2400 25.4 [CAL]=
  - Next we enter the coordinate menu
    - =[DCRD]=
  - We enter the origin point
    - =150 [ENTER] 160 [ORIG]=
  - Now we enter the coordinates of our flaw
    - =713 [ENTER] 956 [PX>DC]= → 5.9584 + 8.424333i mm
  - Finally we convert this to Thirkell
    - =[MM>T]= → Thirkell: 2C

