docs/phil.html

<div id="outline-container-org3a73c28" class="outline-3">
<h3 id="org3a73c28"><span class="section-number-3">7.1</span> Examples</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li><code>123 [ENTER] 123 [COMPLEX] [ANGLE]</code> → -45 &#x2013; assuming degree angle mode</li>
</ul>
</div>
</div>

<div id="outline-container-orgde00f9b" class="outline-3">
<h3 id="orgde00f9b"><span class="section-number-3">7.2</span> Philatelic Application: Parallel Lines (Take 1)</h3>
<div class="outline-text-3" id="text-7-2">
<p>
For an alternative approach see: <a href="#org5ee5397">Philatelic Application: Parallel Lines (Take 2)</a>.
</p>

<p>
Why?
</p>
<ul class="org-ul">
<li>Verify that the two cut edges of a US coil stamp are parallel</li>
<li>Verify that perforations are parallel</li>
<li>Verify that the cut edge of a souvenir sheet is parallel with an engraved margin line</li>
<li>Verify that design edges are parallel &#x2013; to make sure an image has no perspective distortion</li>
</ul>
</div>

<div id="outline-container-org1d0731a" class="outline-4">
<h4 id="org1d0731a"><span class="section-number-4">7.2.1</span> Example</h4>
<div class="outline-text-4" id="text-7-2-1">
<pre class="example" id="org0410054">
P1 *    * P3                                       P1 *    * P3
   |    |              P1 *-----* P2                 /    /
   |    |      _OR_                     _OR_        /    /
   |    |              P3 *-----* P4               /    /
P2 *    * P4                                   P2 *    * P4
</pre>

<ul class="org-ul">
<li>Angle 1: <code>P1.x [ENTER] P1.y [COMPLEX] P2.x [ENTER] P2.y [COMPLEX] [-] [ANGLE] [STO 00]</code></li>
<li>Angle 2: <code>P3.x [ENTER] P3.y [COMPLEX] P4.x [ENTER] P4.y [COMPLEX] [-] [ANGLE] [STO 00]</code></li>
<li>Difference: <code>[RCL- 00] [ABS]</code></li>
</ul>

<p>
The result will be the absolute angle by which the two lines differ &#x2013; i.e. if we have parallel lines it should be 0.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf71931e" class="outline-2">
<h2 id="orgf71931e"><span class="section-number-2">8</span> <code>[DCRD]</code>: Design Coordinates</h2>
<div class="outline-text-2" id="text-8">
<p>
Design Coordinates are used to locate points on a stamp referenced to the design.  A few different schemes are in use with the <i>"Thirkell" philatelic position
finder</i> probably the most popular.  Most of these systems work the same way.  They use the upper left corner of the stamp design as the <i>origin</i> of a
coordinate system &#x2013; i.e. they measure distance to the right and down from the upper left corner of the design.  The most common unit of measurement is
millimeters; however, a few also add a grid system on top.  For example the Thirkell uses a 3mm grid.
</p>


<pre class="example" id="org6360056">
+^^^^^^^^^^^^^^^^^^^^^^^^+
(          * P3          )
(   O *------------+     ) 
(     |            |     )   - Design coordinates are used locate points on the stamp
(     |            |     )    - for a point (x,y) is (x-O_x, y-O_y)
(     |   * P1     |     )    - The most common units are mm
(     |            |     )    - Axis orientation: Coordinate values get bigger to the right or down
(     |            |     )    - These kinds of coordinates are frequently used to locate plate flaws                                                               
(     |            |     )  - Special cases                                                                                                                        
(     +------------+     )    - Points above or to the left of O will have negative coordinates -- Ex: P3                                                          
(                   P2 * )    - Points need not be inside the design -- Ex: P2 &amp; P3                                                                                  
+vvvvvvvvvvvvvvvvvvvvvvvv+
</pre>

<p>
When working with design coordinates you must first tell the application the coordinates of the <i>origin</i> by entering a complex number representing the pixel
coordinates of the upper left corner of the design and hitting the <code>[ORIG]</code> button.  If you shift press this button then it will display the current origin.
</p>

<p>
Now you can convert pixel coordinates to and from design coordinates.
</p>

<p>
Two functions are also available to convert standard millimeter design coordinates to and from Thirkell coordinates: <code>[MM&gt;T]</code> &amp; <code>[T&gt;MM]</code>.  Note that Thirkell
coordinates are reversed &#x2013; i.e. the first coordinate (the letter) is on the vertical axis and the second coordinate (the integer) is on the horizontal axis.
These functions work in millimeters directly, and do <b>not</b> require the image to be calibrated; however, if you wish to use these functions in concert with
<code>[PX&gt;DC]</code> &amp; <code>[DC&gt;PX]</code> then you must calibrate your image and work in millimeters!
</p>

<p>
TIP: <code>[MM&gt;T]</code>, <code>[PX&gt;DC]</code> &amp; <code>[DC&gt;PX]</code> require a complex number.  If you provide something else they will call <code>COMPLEX</code> to convert the lower two stack levels
into a complex number.  This saves the user two key presses &#x2013; i.e. you don't have to hit <code>[SHIFT] [COMPLEX]</code> to convert to complex before you use <code>[ANGL]</code>.
</p>
</div>

<div id="outline-container-org188f4ea" class="outline-3">
<h3 id="org188f4ea"><span class="section-number-3">8.1</span> Example</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Scenario: You wish to report a new plate flaw to the nice people that make the <i>Zumstein</i> catalog using the Thirkell grid.  We have a 2400 DPI scan.  
</p>

<p>
First we locate the upper left hand corner of the design and our plate flaw:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Item</th>
<th scope="col" class="org-left">Pixel Coordinates</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Upper left corner of design</td>
<td class="org-left">(150, 160)</td>
</tr>

<tr>
<td class="org-left">Center of our plate flaw</td>
<td class="org-left">(713, 956)</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Calibration.  If we have not already calibrated, we need to do that first
<ul class="org-ul">
<li><code>2400 25.4 [CAL]</code></li>
</ul></li>
<li>Next we enter the coordinate menu
<ul class="org-ul">
<li><code>[DCRD]</code></li>
</ul></li>
<li>We enter the origin point
<ul class="org-ul">
<li><code>150 [ENTER] 160 [ORIG]</code></li>
</ul></li>
<li>Now we enter the coordinates of our flaw
<ul class="org-ul">
<li><code>713 [ENTER] 956 [PX&gt;DC]</code> → 5.9584 + 8.424333i mm</li>
</ul></li>
<li>Finally we convert this to Thirkell
<ul class="org-ul">
<li><code>[MM&gt;T]</code> → Thirkell: 2C</li>
</ul></li>
</ul>
</div>
</div>
</div>
