src/phil.org
* =[QUAD]=: A Philatelic Power Tool

This is a handy tool that automates some common computations:

 - Compute width & height of a rectangular stamp design
 - Determine if two lines are parallel
 - Determine if four points Determine a parallelogram -- i.e. are the opposite sides parallel

It is called "=QUAD=" because it works with four points which will form the corners of a quadrilateral -- also "=QUAD=" avoid confusion with the built in
command =RECT=.  Below is a picture of the geometric situation.

#+begin_src text
        P1 *----------------* P2
          /                /      - Are P1-P2 & P4-P3 parallel?  i.e. is the angle between them zero?
         /                /       - Are P1-P4 & P2-P3 parallel?  i.e. is the angle between them zero?
        /                /        - What are the lengths of P1-P2 & P4-P3?
       /                /         - What are the lengths of P1-P4 & P2-P3?
      /                /          
     /                /
 P4 *----------------* P3
#+end_src

When using the =QUAD= tool, the first step is to input the corner coordinates via =[UL]=, =[UR]=, =[LR]=, & =[LL]=.

In this context:

#+ATTR_HTML: :align center
|------+-------------+--------------|
| Menu | Corner      | Point Number |
|------+-------------+--------------|
| UL   | Upper Left  | Point P1     |
| UR   | Upper Right | Point P2     |
| LR   | Lower Right | Point P3     |
| LL   | Lower Left  | Point P4     |
|------+-------------+--------------|

TIP: The data entry keys (=[UL]=, =[UR]=, =[LR]=, & =[LL]=) each require a complex number.  If you provide something else they will call =COMPLEX= to convert
the lower two stack levels into a complex number.  This saves the user two key presses -- i.e. you don't have to hit =[SHIFT] [COMPLEX]= to convert to complex
before you use =[ANGL]=.

** Philatelic Application: Parallel Lines (Take 2)

For an alternative approach see: [[Philatelic Application: Parallel Lines (Take 1)][Philatelic Application: Parallel Lines (Take 1)]].

A typical US Washington-Franklin vertical coil has a paper width of about 21.5mm.  Because of the way the stamps were cut into coils, the flat sides should be
absolutely parallel.

Scenario: We have a Washington-Franklin vertical coil, and wish to verify that the flat edges are parallel.  We have a 2400 DPI scan.

Our first step is to identify two points in each edge.  The points should be separated as far apart as possible.  Suppose this results in the
following:

#+ATTR_HTML: :align center
|-------------+--------------|
| Corner      | Coordinates  |
|-------------+--------------|
| Upper left  | (150, 160)   |
| Upper right | (2182, 122)  |
| Lower right | (2181, 2250) |
| Lower left  | (149, 2132)  |
|-------------+--------------|

Note that we didn't try to line the points up horizontally -- our upper left point is at 160 while our upper right point is at 122!

  - Calibration.  If we have not already calibrated, we need to do that first
    - =2400 25.4 [CAL]=
  - Now we enter the corner data
    - =[QUAD] 150 [ENTER] 160 [UL] 2182 [ENTER] 122 [UR] 2181 [ENTER] 2250 [LR] 149 2132 [LL]=
  - Now we can compute the LR Angle:
    - =[∡LR]= → 0.0021 -- assuming =DEG= angle mode

** Philatelic Application: Rotary Press vs. Flat Plate (Take 2)

For an alternative approach see: [[Philatelic Application: Rotary Press vs. Flat Plate (Take 1)][Philatelic Application: Rotary Press vs. Flat Plate (Take 1)]]

Scenario: We have a Washington-Franklin, and we would like to know if it was printed on a rotary press.  We have a 2400 DPI scan.

For reference, here are the measurements for the various printing options:
#+ATTR_HTML: :align center
| Press    | Width     | Height    |
|----------+-----------+-----------|
| Flat     | 18.5-19mm | 22mm      |
| Rot Vert | 18.5-19mm | 22.5-23mm |
| Rot Horz | 19.5-20mm | 22mm      |

We begin by locating the coordinates for four frame corners:
#+ATTR_HTML: :align center
|-------------+--------------|
| Corner      | Coordinates  |
|-------------+--------------|
| Upper left  | (150, 160)   |
| Upper right | (1903, 161)  |
| Lower right | (1902, 2240) |
| Lower left  | (149, 2239)  |
|-------------+--------------|

  - Calibration.  If we have not already calibrated, we need to do that first
    - =2400 25.4 [CAL]=
  - Now we enter the corner data
    - =[QUAD] 150 [ENTER] 160 [UL] 1903 [ENTER] 161 [UR] 1902 [ENTER] 2240 [LR] 149 2239 [LL]=
  - Now we can compute the width:
    - =[WIDE]= → 18.553 mm
  - And the height:
    - =[TALL]= → 22.00 mm

Our stamp is 18.553mm x 22.00mm -- and so it must be a flat plate stamp.

* Code
