docs/phil.html

<div id="outline-container-orge67e1fa" class="outline-2">
<h2 id="orge67e1fa"><span class="section-number-2">9</span> <code>[QUAD]</code>: A Philatelic Power Tool</h2>
<div class="outline-text-2" id="text-9">
<p>
This is a handy tool that automates some common computations:
</p>

<ul class="org-ul">
<li>Compute width &amp; height of a rectangular stamp design</li>
<li>Determine if two lines are parallel</li>
<li>Determine if four points Determine a parallelogram &#x2013; i.e. are the opposite sides parallel</li>
</ul>

<p>
It is called "<code>QUAD</code>" because it works with four points which will form the corners of a quadrilateral &#x2013; also "<code>QUAD</code>" avoid confusion with the built in
command <code>RECT</code>.  Below is a picture of the geometric situation.
</p>

<pre class="example" id="orga9ee548">
       P1 *----------------* P2
         /                /      - Are P1-P2 &amp; P4-P3 parallel?  i.e. is the angle between them zero?
        /                /       - Are P1-P4 &amp; P2-P3 parallel?  i.e. is the angle between them zero?
       /                /        - What are the lengths of P1-P2 &amp; P4-P3?
      /                /         - What are the lengths of P1-P4 &amp; P2-P3?
     /                /          
    /                /
P4 *----------------* P3
</pre>

<p>
When using the <code>QUAD</code> tool, the first step is to input the corner coordinates via <code>[UL]</code>, <code>[UR]</code>, <code>[LR]</code>, &amp; <code>[LL]</code>.
</p>

<p>
In this context:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">Corner</th>
<th scope="col" class="org-left">Point Number</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">UL</td>
<td class="org-left">Upper Left</td>
<td class="org-left">Point P1</td>
</tr>

<tr>
<td class="org-left">UR</td>
<td class="org-left">Upper Right</td>
<td class="org-left">Point P2</td>
</tr>

<tr>
<td class="org-left">LR</td>
<td class="org-left">Lower Right</td>
<td class="org-left">Point P3</td>
</tr>

<tr>
<td class="org-left">LL</td>
<td class="org-left">Lower Left</td>
<td class="org-left">Point P4</td>
</tr>
</tbody>
</table>

<p>
TIP: The data entry keys (<code>[UL]</code>, <code>[UR]</code>, <code>[LR]</code>, &amp; <code>[LL]</code>) each require a complex number.  If you provide something else they will call <code>COMPLEX</code> to convert
the lower two stack levels into a complex number.  This saves the user two key presses &#x2013; i.e. you don't have to hit <code>[SHIFT] [COMPLEX]</code> to convert to complex
before you use <code>[ANGL]</code>.
</p>
</div>

<div id="outline-container-org5ee5397" class="outline-3">
<h3 id="org5ee5397"><span class="section-number-3">9.1</span> Philatelic Application: Parallel Lines (Take 2)</h3>
<div class="outline-text-3" id="text-9-1">
<p>
For an alternative approach see: <a href="#orgde00f9b">Philatelic Application: Parallel Lines (Take 1)</a>.
</p>

<p>
A typical US Washington-Franklin vertical coil has a paper width of about 21.5mm.  Because of the way the stamps were cut into coils, the flat sides should be
absolutely parallel.
</p>

<p>
Scenario: We have a Washington-Franklin vertical coil, and whish to verify that the flat edges are parallel.  We have a 2400 DPI scan.
</p>

<p>
Our first step is to identify two points in each edge.  The points should be seporated as far apart as possible.  Suppose this results in the
following:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Corner</th>
<th scope="col" class="org-left">Coordinates</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Upper left</td>
<td class="org-left">(150, 160)</td>
</tr>

<tr>
<td class="org-left">Upper right</td>
<td class="org-left">(2182, 122)</td>
</tr>

<tr>
<td class="org-left">Lower right</td>
<td class="org-left">(2181, 2250)</td>
</tr>

<tr>
<td class="org-left">Lower left</td>
<td class="org-left">(149, 2132)</td>
</tr>
</tbody>
</table>

<p>
Note that we didn't try to line the points up horizontally &#x2013; our uper left poit is at 160 while our upper right point is at 122!
</p>

<ul class="org-ul">
<li>Calibration.  If we have not already calibrated, we need to do that first
<ul class="org-ul">
<li><code>2400 25.4 [CAL]</code></li>
</ul></li>
<li>Now we enter the corner data
<ul class="org-ul">
<li><code>[QUAD] 150 [ENTER] 160 [UL] 2182 [ENTER] 122 [UR] 2181 [ENTER] 2250 [LR] 149 2132 [LL]</code></li>
</ul></li>
<li>Now we can compute the LR Angle:
<ul class="org-ul">
<li><code>[∡LR]</code> → 0.0021 &#x2013; assuming <code>DEG</code> angle mode</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf3246a3" class="outline-3">
<h3 id="orgf3246a3"><span class="section-number-3">9.2</span> Philatelic Application: Rotary Press vs. Flat Plate (Take 2)</h3>
<div class="outline-text-3" id="text-9-2">
<p>
For an alternative approach see: <a href="#org6b47821">Philatelic Application: Rotary Press vs. Flat Plate (Take 1)</a>
</p>

<p>
Scenario: We have a Washington-Franklin, and we would like to know if it was printed on a rotary press.  We have a 2400 DPI scan.
</p>

<p>
For reference, here are the measurements for the various printing options:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Press</th>
<th scope="col" class="org-left">Width</th>
<th scope="col" class="org-left">Height</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Flat</td>
<td class="org-left">18.5-19mm</td>
<td class="org-left">22mm</td>
</tr>

<tr>
<td class="org-left">Rot Vert</td>
<td class="org-left">18.5-19mm</td>
<td class="org-left">22.5-23mm</td>
</tr>

<tr>
<td class="org-left">Rot Horz</td>
<td class="org-left">19.5-20mm</td>
<td class="org-left">22mm</td>
</tr>
</tbody>
</table>

<p>
We begin by locating the coordinates for four frame corners:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Corner</th>
<th scope="col" class="org-left">Coordinates</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Upper left</td>
<td class="org-left">(150, 160)</td>
</tr>

<tr>
<td class="org-left">Upper right</td>
<td class="org-left">(1903, 161)</td>
</tr>

<tr>
<td class="org-left">Lower right</td>
<td class="org-left">(1902, 2240)</td>
</tr>

<tr>
<td class="org-left">Lower left</td>
<td class="org-left">(149, 2239)</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Calibration.  If we have not already calibrated, we need to do that first
<ul class="org-ul">
<li><code>2400 25.4 [CAL]</code></li>
</ul></li>
<li>Now we enter the corner data
<ul class="org-ul">
<li><code>[QUAD] 150 [ENTER] 160 [UL] 1903 [ENTER] 161 [UR] 1902 [ENTER] 2240 [LR] 149 2239 [LL]</code></li>
</ul></li>
<li>Now we can compute the width:
<ul class="org-ul">
<li><code>[WIDE]</code> → 18.553 mm</li>
</ul></li>
<li>And the height:
<ul class="org-ul">
<li><code>[TALL]</code> → 22.00 mm</li>
</ul></li>
</ul>

<p>
Our stamp is 18.553mm x 22.00mm &#x2013; and so it must be a flat plate stamp.
</p>
</div>
</div>
</div>
