docs/phil.html

<div id="outline-container-org9c440b9" class="outline-3">
<h3 id="org9c440b9"><span class="section-number-3">10.2</span> Local Functions</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-hp42s"><span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: PhilIC -- Image calibration factor.  Set via CAL</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">PhilIU -- Units for Image distances used by D&#8594;P &amp; D&#8594;K.  Set via I:UNIT Default: mm</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">PhilDU -- Units for Distance used by D&#8594;P &amp; D&#8594;K.  Set via D:UNIT Default: mm</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">PhilPC -- Perf count used by used by D&#8594;P &amp; D&#8594;K.  Set via C:NN.  Default: 10</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">PhilCo -- Orition for design coordinates.  Default: (0, 0)</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">PhilP1 -- Point</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">PhilP2 -- Point</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">PhilP3 -- Point</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">PhilP4 -- Point</span>


<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: SET-REP-P1 57</span>
<span style="color: #00ffff;">LBL</span> 57
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">REAL</span>?
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">FS</span>? 64
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP1"</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"PhilP1"</span>
<span style="color: #fa8072;">"P1: "</span>
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: SET-REP-P2 58</span>
<span style="color: #00ffff;">LBL</span> 58
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">REAL</span>?
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">FS</span>? 64
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP2"</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"PhilP2"</span>
<span style="color: #fa8072;">"P2: "</span>
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: SET-REP-P3 59</span>
<span style="color: #00ffff;">LBL</span> 59
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">REAL</span>?
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">FS</span>? 64
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP3"</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"PhilP3"</span>
<span style="color: #fa8072;">"P3: "</span>
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: SET-REP-P4 60</span>
<span style="color: #00ffff;">LBL</span> 60
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">REAL</span>?
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">FS</span>? 64
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP4"</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"PhilP4"</span>
<span style="color: #fa8072;">"P4: "</span>
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: NUM-P 61</span>
<span style="color: #00ffff;">LBL</span> 61
<span style="color: #00ffff;">FUNC</span> 01
<span style="color: #00ffff;">L4STK</span>
0
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"TMPC"</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP1"</span>
<span style="color: #00ffff;">FS?C</span> 25
<span style="color: #00ffff;">ISG</span> <span style="color: #fa8072;">"TMPC"</span>
<span style="color: #00ffff;">NOP</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP2"</span>
<span style="color: #00ffff;">FS?C</span> 25
<span style="color: #00ffff;">ISG</span> <span style="color: #fa8072;">"TMPC"</span>
<span style="color: #00ffff;">NOP</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP3"</span>
<span style="color: #00ffff;">FS?C</span> 25
<span style="color: #00ffff;">ISG</span> <span style="color: #fa8072;">"TMPC"</span>
<span style="color: #00ffff;">NOP</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP4"</span>
<span style="color: #00ffff;">FS?C</span> 25
<span style="color: #00ffff;">ISG</span> <span style="color: #fa8072;">"TMPC"</span>
<span style="color: #00ffff;">NOP</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"TMPC"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Action for &#8737;TB</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: TB_ANGLE 62</span>
<span style="color: #00ffff;">LBL</span> 62
<span style="color: #00ffff;">FUNC</span> 01
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">XEQ</span> 61
4
<span style="color: #00ffff;">X&#8800;Y</span>?
<span style="color: #00ffff;">GTO</span> 56
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP2"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"PhilP1"</span>
<span style="color: #00ffff;">XEQ</span> 37 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">ANGLE</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP3"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"PhilP4"</span>
<span style="color: #00ffff;">XEQ</span> 37 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">ANGLE</span>
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Action for &#8737;LR</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: LR_ANGLE 63</span>
<span style="color: #00ffff;">LBL</span> 63
<span style="color: #00ffff;">FUNC</span> 01
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">XEQ</span> 61
4
<span style="color: #00ffff;">X&#8800;Y</span>?
<span style="color: #00ffff;">GTO</span> 56
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP4"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"PhilP1"</span>
<span style="color: #00ffff;">XEQ</span> 37 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">ANGLE</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP3"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"PhilP2"</span>
<span style="color: #00ffff;">XEQ</span> 37 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">ANGLE</span>
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Action for WIDE</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: LR_ANGLE 64</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: Z: Top Width</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: Y: Bottom Width</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: Average Width</span>
<span style="color: #00ffff;">LBL</span> 64
<span style="color: #00ffff;">FUNC</span> 03
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">XEQ</span> 61
4
<span style="color: #00ffff;">X&#8800;Y</span>?
<span style="color: #00ffff;">GTO</span> 56
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP2"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"PhilP1"</span>
<span style="color: #00ffff;">XEQ</span> 91 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Convert PX to length</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP3"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"PhilP4"</span>
<span style="color: #00ffff;">XEQ</span> 91 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Convert PX to length</span>
<span style="color: #00ffff;">RCL ST</span> Y
<span style="color: #00ffff;">RCL ST</span> Y
<span style="color: #00ffff;">+</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Action for TALL</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: LR_ANGLE 65</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: Z: LEFT</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: Y: RIGHT</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: Average Width</span>
<span style="color: #00ffff;">LBL</span> 65
<span style="color: #00ffff;">FUNC</span> 03
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">XEQ</span> 61
4
<span style="color: #00ffff;">X&#8800;Y</span>?
<span style="color: #00ffff;">GTO</span> 56
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP4"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"PhilP1"</span>
<span style="color: #00ffff;">XEQ</span> 91 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Convert PX to length</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilP3"</span>
<span style="color: #00ffff;">RCL-</span> <span style="color: #fa8072;">"PhilP2"</span>
<span style="color: #00ffff;">XEQ</span> 91 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Convert PX to length</span>
<span style="color: #00ffff;">RCL ST</span> Y
<span style="color: #00ffff;">RCL ST</span> Y
<span style="color: #00ffff;">+</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: ERR: Enter Data First</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: NOT A FUNCTION.  GTO Target</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: EEDF 56</span>
<span style="color: #00ffff;">LBL</span> 56
<span style="color: #fa8072;">"ERR: Enter"</span>
&#9500;<span style="color: #fa8072;">" Corners"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: DCRD:ORIG 90</span>
<span style="color: #00ffff;">LBL</span> 90
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">REAL</span>?
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">FC</span>? 64
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"PhilCo"</span>
<span style="color: #00ffff;">XEQ</span> 45 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilCo"</span>
<span style="color: #fa8072;">"Orig: "</span>
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: ACTION for DCRD:PX&gt;DC</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: DCRD:PX&gt;DC 75</span>
<span style="color: #00ffff;">LBL</span> 75
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">REAL</span>?
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">XEQ</span> 68 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">CPLX-PX&gt;DC</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: CPLX-PX&gt;DC</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: CPLX-PX&gt;DC for complex input</span>
<span style="color: #00ffff;">LBL</span> 68
<span style="color: #00ffff;">FUNC</span> 11
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">XEQ</span> 45 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilCo"</span>
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">XEQ</span> 91 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Convert PX to Distance</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: ACTION for DCRD:DC&gt;PX</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: DCRD:DC&gt;PX 49</span>
<span style="color: #00ffff;">LBL</span> 49
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">REAL</span>?
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">XEQ</span> 69 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">CPLX-PX&gt;DC</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: CPLX-PX&gt;DC 69</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: CPLX-DC&gt;PX for complex input only</span>
<span style="color: #00ffff;">LBL</span> 69
<span style="color: #00ffff;">FUNC</span> 11
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">XEQ</span> 66 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Convert Distance to PX</span>
<span style="color: #00ffff;">XEQ</span> 45 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilCo"</span>
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Return PhilCo.  Set it to default if it is unset.</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: GET PhilCo  45</span>
<span style="color: #00ffff;">LBL</span> 45
<span style="color: #00ffff;">FUNC</span> 01
<span style="color: #00ffff;">L4STK</span>
0
0
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilCo"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"PhilCo"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: ACTION for FOO</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: DCRD:MM&gt;T 48</span>
<span style="color: #00ffff;">LBL</span> 48
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">REAL</span>?
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">XEQ</span> 38 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">CPLX-MM&gt;T</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: CPLX-MM&gt;T 38</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: CPLX-MM&gt;T complex input only</span>
<span style="color: #00ffff;">LBL</span> 38
<span style="color: #00ffff;">FUNC</span> 11
<span style="color: #00ffff;">L4STK</span>
3
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">IP</span>
<span style="color: #00ffff;">ABS</span>         <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Y X</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>        <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X Y</span>
<span style="color: #00ffff;">IP</span>
<span style="color: #00ffff;">ABS</span>
1
<span style="color: #00ffff;">+</span>           <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X Y</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>        <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Y X</span>
65
<span style="color: #00ffff;">+</span>           <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Y X</span>
86          <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">86 Y X</span>
<span style="color: #00ffff;">X&gt;Y</span>?
<span style="color: #00ffff;">GTO</span> 46
<span style="color: #00ffff;">X&lt;&gt;Y</span>        <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Y 86 X</span>
R&#8595;          <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">86 X</span>
63          <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">63 86 X</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>        <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">86 63 X</span>
<span style="color: #00ffff;">LBL</span> 46
R&#8595;          <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">CHAR-NUM X</span>
<span style="color: #fa8072;">"Thirkell: "</span>
<span style="color: #00ffff;">XTOA</span>
R&#8595;          <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X</span>
<span style="color: #00ffff;">AIP</span>   
R&#8595;
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: DCRD:T&gt;MM 43</span>
<span style="color: #00ffff;">LBL</span> 43
<span style="color: #00ffff;">FUNC</span> 01
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">LBL</span> 40
LASTO <span style="color: #fa8072;">"TMPS"</span>
<span style="color: #00ffff;">ALENG</span>
2
<span style="color: #00ffff;">X&gt;Y</span>?
<span style="color: #00ffff;">GTO</span> 47
R&#8595;
3
<span style="color: #00ffff;">X&lt;Y</span>?
<span style="color: #00ffff;">GTO</span> 47
R&#8595;
R&#8595;
<span style="color: #00ffff;">ATOX</span>
65
<span style="color: #00ffff;">X&gt;Y</span>?
<span style="color: #00ffff;">GTO</span> 47
R&#8595;
84
<span style="color: #00ffff;">X&lt;Y</span>?
<span style="color: #00ffff;">GTO</span> 47
R&#8595;
3
<span style="color: #00ffff;">&#215;</span>
ANUM
<span style="color: #00ffff;">FC</span>? 22
<span style="color: #00ffff;">GTO</span> 47
1
<span style="color: #00ffff;">X&gt;Y</span>?
<span style="color: #00ffff;">GTO</span> 47
R&#8595;
17
<span style="color: #00ffff;">X&lt;Y</span>?
<span style="color: #00ffff;">GTO</span> 47
R&#8595;
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">FP</span>
<span style="color: #00ffff;">X&#8800;0</span>?
<span style="color: #00ffff;">GTO</span> 47
R&#8595;
1
<span style="color: #00ffff;">-</span>
3
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">CLA</span>
<span style="color: #00ffff;">ARCL</span> <span style="color: #fa8072;">"TMPS"</span>
&#9500;<span style="color: #fa8072;">"&#8594;"</span>
<span style="color: #00ffff;">ARCL</span> ST X
&#9500;<span style="color: #fa8072;">" mm"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 47
<span style="color: #fa8072;">"Enter Thir"</span>
&#9500;<span style="color: #fa8072;">"kell; R/S"</span>
<span style="color: #00ffff;">AON</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">AOFF</span>
<span style="color: #00ffff;">GTO</span> 40
<span style="color: #00ffff;">RTN</span>
   
<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: ANGL Label 85</span>
<span style="color: #00ffff;">LBL</span> 85
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">RECT</span>  <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">We require RECT mode!</span>
<span style="color: #fa8072;">"ANGL"</span>
<span style="color: #00ffff;">XEQ</span> 79 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilIU"</span>
<span style="color: #00ffff;">XEQ</span> 77 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilDU"</span>
<span style="color: #00ffff;">XEQ</span> 78 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilPC"</span>
<span style="color: #00ffff;">XEQ</span> 76 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilIC"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: CAL in PERF Label 67</span>
<span style="color: #00ffff;">LBL</span> 67
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">XEQ</span> 77 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilDU"</span>
<span style="color: #00ffff;">X&#8800;0</span>?         <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IF-BOOL</span>
<span style="color: #00ffff;">RTNNO</span>
<span style="color: #fa8072;">"CAL"</span>
<span style="color: #00ffff;">RTNYES</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: I: Label 86</span>
<span style="color: #00ffff;">LBL</span> 86
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">CLA</span>
<span style="color: #00ffff;">XEQ</span> 77 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilDU"</span>
<span style="color: #00ffff;">X&#8800;0</span>?         <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IF-BOOL</span>
<span style="color: #00ffff;">RTNNO</span>
<span style="color: #fa8072;">"I:"</span>
<span style="color: #00ffff;">XEQ</span> 79 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilIU"</span>
70
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">XEQ IND ST</span> X
R&#8595;
<span style="color: #00ffff;">RTNYES</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: D: Label 89</span>
<span style="color: #00ffff;">LBL</span> 89
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">L4STK</span>
<span style="color: #fa8072;">"D:"</span>
<span style="color: #00ffff;">XEQ</span> 77 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilDU"</span>
50
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">XEQ IND ST</span> X
R&#8595;
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: C: Label 87</span>
<span style="color: #00ffff;">LBL</span> 87
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">L4STK</span>
<span style="color: #fa8072;">"C:"</span>
<span style="color: #00ffff;">XEQ</span> 78 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilPC"</span>
<span style="color: #00ffff;">AIP</span>
R&#8595;
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Action for menu key ANGLE</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: ANGLE 92</span>
<span style="color: #00ffff;">LBL</span> 92
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">REAL</span>?
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">XEQ</span> 37 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">CPLX-FOO</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: CPLX-ANGLE 37</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: CPLX-ANGLE complex input only</span>
<span style="color: #00ffff;">LBL</span> 37
<span style="color: #00ffff;">FUNC</span> 11
<span style="color: #00ffff;">L4STK</span>
<span style="color: #00ffff;">FC</span>? 73 <span style="color: #ffa500;">@@ </span><span style="color: #ff7f24;">IF-RECT</span>
<span style="color: #00ffff;">GTO</span> 42
<span style="color: #00ffff;">GTO</span> 31
<span style="color: #00ffff;">LBL</span> 42 <span style="color: #ffa500;">@@ </span><span style="color: #ff7f24;">IF-THEN RECT MODE</span>
<span style="color: #00ffff;">POLAR</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">RECT</span>
<span style="color: #00ffff;">GTO</span> 44
<span style="color: #00ffff;">LBL</span> 31 <span style="color: #ffa500;">@@ </span><span style="color: #ff7f24;">IF-ELSE POLAR MODE</span>
<span style="color: #00ffff;">POLAR</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">RECT</span>
<span style="color: #00ffff;">LBL</span> 44 <span style="color: #ffa500;">@@ </span><span style="color: #ff7f24;">IF-END</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
R&#8595;
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Action for menu key CAL</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: CAL 95</span>
<span style="color: #00ffff;">LBL</span> 95
<span style="color: #00ffff;">FUNC</span> 00            <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">FS</span>? 64
<span style="color: #00ffff;">GTO</span> 29
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"PhilIC"</span>
<span style="color: #00ffff;">LBL</span> 29
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilIC"</span>
<span style="color: #fa8072;">"Cal: "</span>
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Action for menu key D&#8594;P</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: D&#8594;P 96</span>
<span style="color: #00ffff;">LBL</span> 96
<span style="color: #00ffff;">FUNC</span> 11            <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">XEQ</span> 39 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Convert distance to mm</span>
<span style="color: #00ffff;">XEQ</span> 78 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilPC"</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">&#247;</span>
20
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Action for menu key P&lt;&gt;K</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: P&lt;&gt;K 97</span>
<span style="color: #00ffff;">LBL</span> 97
<span style="color: #00ffff;">FUNC</span> 11            <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
127
<span style="color: #00ffff;">&#215;</span>
100000
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Action for menu key C:</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: C: 98</span>
<span style="color: #00ffff;">LBL</span> 98
<span style="color: #00ffff;">FUNC</span> 00            <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"PhilPC"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Action for menu key D:UNIT</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: D: 99</span>
<span style="color: #00ffff;">LBL</span> 99
<span style="color: #00ffff;">FUNC</span> 00            <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">XEQ</span> 77 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilDU"</span>
1
<span style="color: #00ffff;">+</span>
6
<span style="color: #00ffff;">MOD</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"PhilDU"</span>
R&#8595;
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Action for menu key I:UNIT</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: I: 88</span>
<span style="color: #00ffff;">LBL</span> 88
<span style="color: #00ffff;">FUNC</span> 00            <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">XEQ</span> 79 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilIU"</span>
1
<span style="color: #00ffff;">+</span>
5
<span style="color: #00ffff;">MOD</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"PhilIU"</span>
R&#8595;
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Convert distance to mm</span>
<span style="color: #00ffff;">LBL</span> 39
<span style="color: #00ffff;">FUNC</span> 01            <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">XEQ</span> 77 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilDU"</span>
<span style="color: #00ffff;">X=0</span>?         <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IF-BOOL</span>
<span style="color: #00ffff;">GTO</span> 34
<span style="color: #00ffff;">GTO</span> 35
<span style="color: #00ffff;">LBL</span> 34       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IF-THEN (pixels)</span>
R&#8595;
<span style="color: #00ffff;">XEQ</span> 91 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Convert PX to I units</span>
<span style="color: #00ffff;">XEQ</span> 79 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilIU"</span>
80
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">XEQ IND ST</span> X
<span style="color: #00ffff;">GTO</span> 36
<span style="color: #00ffff;">LBL</span> 35       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IF-ELSE (not-pixels)</span>
80
<span style="color: #00ffff;">+</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">XEQ IND ST</span> X
<span style="color: #00ffff;">LBL</span> 36       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IF-END</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Action for menu key PX&gt;D</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: PX&gt;D 91</span>
<span style="color: #00ffff;">LBL</span> 91
<span style="color: #00ffff;">FUNC</span> 11            <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">XEQ</span> 76 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilIC"</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Action for menu key D&gt;PX</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: D&gt;PX 66</span>
<span style="color: #00ffff;">LBL</span> 66
<span style="color: #00ffff;">FUNC</span> 11            <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">XEQ</span> 76 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilIC"</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Names for D units</span>
<span style="color: #00ffff;">LBL</span> 50
<span style="color: #fa8072;">"&#9500;px"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 51
<span style="color: #fa8072;">"&#9500;mm"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 52
<span style="color: #fa8072;">"&#9500;mil"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 53
<span style="color: #fa8072;">"&#9500;&#956;m"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 54
<span style="color: #fa8072;">"&#9500;in"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 55
<span style="color: #fa8072;">"&#9500;cm"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: @@@@ Names for I units</span>
<span style="color: #00ffff;">LBL</span> 70
<span style="color: #fa8072;">"&#9500;mm"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 71
<span style="color: #fa8072;">"&#9500;mil"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 72
<span style="color: #fa8072;">"&#9500;&#956;m"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 73
<span style="color: #fa8072;">"&#9500;in"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 74
<span style="color: #fa8072;">"&#9500;cm"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Conversion to mm.</span>
<span style="color: #00ffff;">LBL</span> 80       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">"&#9500;mm"</span>
R&#8595;
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 81       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">"&#9500;mil"</span>
R&#8595;
25.4
<span style="color: #00ffff;">&#215;</span>
1000
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 82       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">"&#9500;&#956;m"</span>
R&#8595;
1e3
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 83       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">"&#9500;in"</span>
R&#8595;
25.4
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 84       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">"&#9500;cm"</span>
R&#8595;
10
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: GET PhilIC.  Set to default if not set.</span>
<span style="color: #00ffff;">LBL</span> 76
<span style="color: #00ffff;">FUNC</span> 01
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilIC"</span>
<span style="color: #00ffff;">FS?C</span> 25
<span style="color: #00ffff;">RTN</span>
94.4881889764
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"PhilIC"</span>
<span style="color: #fa8072;">"WARN: "</span>
<span style="color: #fa8072;">"&#9500;CAL Default!"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: GET PhilDU.  Set to default if not set.</span>
<span style="color: #00ffff;">LBL</span> 77
<span style="color: #00ffff;">FUNC</span> 01
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilDU"</span>
<span style="color: #00ffff;">FS?C</span> 25
<span style="color: #00ffff;">RTN</span>
0
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"PhilDU"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: GET PhilPC.  Set to default if not set.</span>
<span style="color: #00ffff;">LBL</span> 78
<span style="color: #00ffff;">FUNC</span> 01
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilPC"</span>
<span style="color: #00ffff;">FS?C</span> 25
<span style="color: #00ffff;">RTN</span>
10
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"PhilPC"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: GET PhilIU.  Set to default if not set.</span>
<span style="color: #00ffff;">LBL</span> 79
<span style="color: #00ffff;">FUNC</span> 01
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"PhilIU"</span>
<span style="color: #00ffff;">FS?C</span> 25
<span style="color: #00ffff;">RTN</span>
0
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"PhilIU"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>

<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">The following functions are not currently used, but may be someday.</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: RESET 94</span>
<span style="color: #00ffff;">LBL</span> 94
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">CLV</span> <span style="color: #fa8072;">"PhilIU"</span>
<span style="color: #00ffff;">CLV</span> <span style="color: #fa8072;">"PhilDU"</span>
<span style="color: #00ffff;">CLV</span> <span style="color: #fa8072;">"PhilPC"</span>
<span style="color: #00ffff;">CLV</span> <span style="color: #fa8072;">"PhilIC"</span>
<span style="color: #00ffff;">XEQ</span> 79 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilIU"</span>
<span style="color: #00ffff;">XEQ</span> 77 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilDU"</span>
<span style="color: #00ffff;">XEQ</span> 78 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilPC"</span>
<span style="color: #00ffff;">XEQ</span> 76 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GET "PhilIC"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgde0564d" class="outline-2">
<h2 id="orgde0564d"><span class="section-number-2">11</span> EOF</h2>
<div class="outline-text-2" id="text-11">
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
</div>
</div>
</div>
<div id="postamble" class="status">
Created by Mitch Richling <<a href="mailto:http://www.mitchr.me/">http://www.mitchr.me/</a>>.  Rendered on 2021-04-16 Fri 18:17 via <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.4.5)
</div>
</body>
</html>
